package may17;

//ctrl + shift + F 자동정렬 -> 에러가 없을때만.

public class Hello2 {
	public static void main(String[] args) {
		System.out.println("한글!");
	}
}

/* 자바의 이름 만들기
 * 코딩을 하다보면 많은 이름을 만들어 사용해야 합니다.
 * 클래스 이름, 메소드 이름, 변수 이름 등등등.....
 * 공통적인 이름 명명방법을 적어드리겠습니다.
 * 
 * 1. 사용 가능한 문자
 * 		영어 대문자, 소문자, 숫자, 특수문자는 _, $
 * 
 * 2. 클래스 이름 규칙               파스칼표기법
 * 		대문자로 시작합니다.
 * 		숫자가 앞에 올 수 없습니다.(숫자 시작X)
 * 		한 단어 이상의 단어 조합이라면
 * 		새로운 단어 첫글자는 대문자로
 * 		예) Hello, HelloKorea
 * 
 * 3. 메소드, 변수 이름 규칙           카멜표기법
 * 		첫글자는 소문자로 시작합니다.
 * 		숫자가 앞에 올 수 없습니다.
 * 		한 단어 이상의 조합이라면
 * 		뒤에오는 단어 첫글자는 대문자로
 * 		예) hello2, hello2, helloKorea
 * 
 * 4. 상수                   스네이크 표기법
 * 		모든 단어를 대문자로
 * 		한단어 이상일 경우에는 _(언더바)로 연결합니다.
 * 		예) HELLO_KOREA
 * 
 * 
 * 
 * 
 * 
 * 
 */