package innerClass;
//Inner Class
/* 내부 클래스
 * 클래스 내부에 또 다른 클래스가 있음.
 * 클래스 내부에 선언된 클래스 임 = 두 클래스가 서로 긴밀한 관계
 * 
 * 장점
 * 내부 클래스에서 외부 클래스의 멤버들을 쉽게 접근 가능함.
 * 캡슐화, 코드의 복잡성을 줄여줌.
 * 
 * 내부 클래스 : 두 클래스가 긴밀하고, 내부 클래스는 잘 사용되지 않는 것.
 * 
 * 종류
 * 
 * 스태틱 클래스 : 외부 클래스의 멤버 변수 선언 위치에 선언,
 * 					static 멤버처럼 다뤄짐.
 * 					주로 외부 클래스의 static 멤버,
 * 					특히 static 메소드에서 사용될 목적으로 선언
 * 
 * 멤버 클래스 : 외부 클래스의 멤버 변수 선언 위치에 선언
 * 				 외부 클래스의 인스턴스 멤버처럼 사용.
 * 				 주로 외부 클래스의 인스턴스 멤버들과 관련된 작업에서 사용.
 * 
 * 
 * 지역 클래스 : 외부 클래스의 메소드나 초기화 블럭 안에서 선언.
 * 				 선언된 영역 내부에서만 사용함.
 * 
 * 익명 클래스 : 클래스 선언과 객체의 생성을 동시에 하는 이름 없는 클래스(일회용). 
 * 
 */
public class InnerClass01 {

	public static void main(String[] args) {


	}

}
